In [ ]:
import pandas as pd

# 01- How to find version

In [ ]:
# Check pandas version
pd.__version__

In [ ]:
# Another way to show pandas verison 
pd.show_versions()

 
# 02- Make a DataFrame

In [ ]:
df = pd.DataFrame({'Col A':[ 1,2,3], "Col B": [4,5,6]})
df

In [ ]:
# Array conversion to DataFrame
import numpy as np
array = np.array([[1,2,3], [4,5,6], [7,8,9]])
array

df = pd.DataFrame(array)
df

In [ ]:
# Creating a DataFrame with random floats 
df = pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))
df

# 03- How to rename a columns?

In [ ]:
# Creating a DataFrame with random integers and specific index and columns with names
df = pd.DataFrame(np.random.randint(1,11,size=(4,8))
                  ,columns=list("ABCDEFGH")
                  , index=['R1', 'R2', 'R3', 'R4'])
df

In [ ]:
df = pd.DataFrame(np.random.randint(1,21, size = (3,3)))
df

In [ ]:
# Change colums name
df.columns=['col1', 'col2','col3']
df

In [ ]:
# Change rows name
df.index=["Row-1", "Row-2", "Row-3"]
df

In [ ]:
# to replace any charactor or string
df.columns = df.columns.str.replace("-","_")

df

In [ ]:
# adding perfix in columns
df = df.add_prefix("A_")
df

In [ ]:
# adding suffix in columns
df = df.add_suffix("_X")
df

In [ ]:
df.columns=["col-1", "col-2", 'col-3']
df

# 04- Using tamplate data

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

In [ ]:
# summary
df.describe()

In [ ]:
# columns name
df.columns

In [ ]:
# rows count
df.index

In [ ]:
# save DataFrame to CSV
df.to_csv("zyx.csv")

In [ ]:
# converted to excel
df.to_excel("xyz.xlsx")
df.head(3)

# 05- Using your own data

In [ ]:
# read from excel
df = pd.read_csv("zyx.csv")
df

# 06- Reverse rows order

In [ ]:
import pandas as pd
import seaborn as sns

In [ ]:
df = sns.load_dataset("titanic")
df.head(3)

In [ ]:
# reverse order
df.loc[::-1].head()

In [ ]:
# reset index 
df.loc[::-1].reset_index(drop=True).head()

# 07- Reverse columns order

In [ ]:
df.loc[:, ::-1].head(3)

# 08- Select a colum by data type

In [ ]:
# select only numeric columns
df.select_dtypes(include=["number"]).head()

In [ ]:
# select only categoryical value
df.select_dtypes(include=['category']).head()

In [ ]:
# select only object type columns
df.select_dtypes(include='object').head()

In [ ]:
#select only Float64 type columns
df.select_dtypes(include='Float64').head()

In [ ]:
# select only number and category type columns
df.select_dtypes(include=['number', 'category']).head(3)

In [ ]:
# select all columns except number type
# This will include all non-numeric columns such as object, category, etc.
df.select_dtypes(exclude=['number']).head()

In [ ]:
# select all columns except category type
# This will include all non-category columns such as object, number, etc.
df.select_dtypes(exclude=['category']).head()

# 09- convert numaric into string

In [ ]:
#
df = pd.DataFrame({ "col_A" :[1,2,3,4,5],
                   'col_B' :[6,7,8,9,10]})
df.dtypes

In [ ]:
# Convert column 'col_A' to string type and 'col_B' to string type
df.astype({'col_A': 'str', "col_B": 'str'}).dtypes

In [ ]:
# Convert column 'col_A' to numeric type, coercing errors means that if there are any non-numeric values, they will be replaced with NaN
pd.to_numeric(df['col_A'],errors="coerce")

# 10- Reduce DataFrame size

In [ ]:
# reduce the DataFrame to a sample of 10% of its rows
df = sns.load_dataset('titanic')

df.sample(frac=0.1).shape
df.info()

# 11- copy DataFrame from clip board

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.to_excel("titanic_sample.xlsx", index=False)

In [ ]:
# read from clipboard
df = pd.read_clipboard()
df

# 12- Split dataframe in two subsets

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

In [ ]:
from random import random
df_1 = df.sample(frac=0.50, random_state=1 )
df_1.shape

In [ ]:
df_2 = df.drop(df_1.index)
df_2.shape

In [ ]:
df_1.head(4)

In [ ]:
df_2.head(4)

In [ ]:
df_1.shape

In [ ]:
df_2.shape

In [ ]:
len(df_2) + len(df_1)

# 13- Concat two datasets in one dataframe

In [ ]:
df = pd.concat([df_1, df_2])
df.shape

# 14- Filtering a dataframe

In [ ]:
df.head()

In [ ]:
df.sex.unique()

In [ ]:
df[(df.sex=="male")]

In [ ]:
df.who.unique()

In [ ]:
df[(df.who=='child') & (df.age>14)]

In [ ]:
df[(df.alive=='yes')].shape

In [ ]:
df[(df.alive=='no')].shape

In [ ]:
df.head()

In [ ]:
df[
    ( (df.embark_town == 'Southampton') ) |
    ( (df.embark_town == 'Queenstown') & (df.alone == "True") )
]

In [ ]:
filter_df = df [(
    (df.age >= 18) &
    (df.sex == "female") &
    (df.alive == 'yes')

)]

In [ ]:
result = filter_df[['age', 'sex', 'alive']]
result

# 15- Filter by large category

In [ ]:
df.sex.value_counts()

In [ ]:
df.alive.value_counts()

In [ ]:
df.alone.value_counts()

In [ ]:
df.age.value_counts().nlargest(4)

In [ ]:
df.age.value_counts().nsmallest(4).index

# 16- Spliting a string into multiple columns

In [272]:
df = pd.DataFrame({"name": ['Ali Raza','Junaid Maseed','Ajmal Afridi'],
                   "address": ['palosa Peshawar', 'warirstan england', 'Hassen khel'] })

df [['First_name', 'Last_name'] ] = df.name.str.split(' ' ,expand=True)

In [273]:
df

            name            address First_name Last_name
0       Ali Raza    palosa Peshawar        Ali      Raza
1  Junaid Maseed  warirstan england     Junaid    Maseed
2   Ajmal Afridi        Hassen khel      Ajmal    Afridi

In [277]:
new_df = df[['Village', 'State']] = df.address.str.split(' ', expand=True)

In [278]:
new_df

           0         1
0     palosa  Peshawar
1  warirstan   england
2     Hassen      khel

In [279]:
df

            name            address First_name Last_name    Village     State
0       Ali Raza    palosa Peshawar        Ali      Raza     palosa  Peshawar
1  Junaid Maseed  warirstan england     Junaid    Maseed  warirstan   england
2   Ajmal Afridi        Hassen khel      Ajmal    Afridi     Hassen      khel